<?php

return array(
    'add-new-user-id-description-1' => '・半角英数字4～31桁。ハイフン（-）またはアンダーライン（_）含む',
    'add-new-user-id-description-2' => '・最初の文字は英字',
    'add-new-email-description' => '半角英数字',
    'add-new-password-description' => '・半角英数字6～32桁。ハイフン（-）またはアンダーライン（_）含む',
    'MSG1'  => '必須入力項目です。',
    'MSG17_AccessKey' => '団体番号又はアクセスキーが不正です。',
    'MSG18_AccessKey' => 'アクセスキーが無効です。管理者にご連絡ください。',
    'MSG21' => 'メールアドレスの形式が正しくありません。',
    'descAccessKey'=>'管理者を登録するために、団体番号とアクセスキーを入力してください。',
    'moreDescAccesskey' => '※アクセスキーは2016年度第1回より簡易書留はがきにてお手元にお送りしています。',
    'titleAccessKey'=>'アクセスキー入力',
    'lableAccessKeyOrgNo'=>'団体番号',
    'descAccessKeyOrgNo'=>'（半角数字8桁）',
    'labelAccessKeyNo'=>'アクセスキー',
    'Next' => '次へ',
    'add-new-save' => '保存',
    'add-new-back' => '戻る',
    'add-new-placeholder-first-name' => '姓',
    'add-new-placeholder-last-name' => '名',
    'MSG19' => 'ユーザIDは以下の規則に準拠している必要があります。<br /> ・ 4～31文字<br />・半角英数字とハイフン（-）、アンダーバー（_）<br />・先頭の1文字目は半角英字',
    'MSG19_FREE_STYLE' => 'ユーザIDは以下の規則に準拠している必要があります。
    ・ 4～31文字
    ・半角英数字とハイフン（-）、アンダーバー（_）
    ・先頭の1文字目は半角英字',
    'MSG41' => '「利用規約に同意する」にチェックが入っていません。',
    'MSG31'  => 'パスワードは以下の規則に準拠している必要があります。</br>・文字数が6～32文字</br>・大文字、小文字、数字の組合せ</br>・ユーザIDと一致しない',
    'MSG31_FREE_STYLE' => 'パスワードは以下の規則に準拠している必要があります。
    ・文字数が6～32文字
    ・大文字、小文字、数字の組合せ
    ・ユーザIDと一致しない',
    'MSG10'  => 'パスワードが一致しません。',
    'EmailAddressDoesNotMatch' => 'メールアドレスが一致しません。',
    'EmailIsUse' => 'このメールアドレスは既存のユーザアカウントに利用されています。新しいユーザアカウントを作るには、別のメールアドレスを利用してください。 ',
    'descAccessKeyToActivate'=>'ユーザIDは英検実施回毎に再有効化が必要です。以下に、アクセスキーを入力してください。<br>アクセスキーがわからない場合は貴団体の管理者様にお問い合わせください。',
    'Active' => '再有効化する',
    'Cancel' => 'キャンセル',
    'titleAccessKeyToActivate'=>'ユーザIDの再有効化が必要です',
    'AccessKeyIsUse' => 'このアクセスキーは既に初期アカウントを作成するために使われています。アカウントを作りおなす場合は「OK」を押してください。',
    'saveSuccessCheckYourEmail' => 'ご本人確認のため入力いただいたメールアドレス宛に確認メールをお送りしました。メールに記載されている情報を確認して、登録手続きへお進みください。'
);