<?php

return array(
    'CLASSFICATION_00' => '小学校',
    'CLASSFICATION_01' => '中学校',
    'CLASSFICATION_02' => '小中一貫校',
    'CLASSFICATION_03' => '小中高一貫校',
    'CLASSFICATION_04' => '中高一貫校',
    'CLASSFICATION_05' => '高校',
    'CLASSFICATION_10' => '短大',
    'CLASSFICATION_15' => '大学',
    'CLASSFICATION_16' => '大学生協',
    'CLASSFICATION_20' => '高専',
    'CLASSFICATION_22' => '官公庁・公営企業体',
    'CLASSFICATION_25' => '企業団体',
    'CLASSFICATION_30' => '専修各種',
    'CLASSFICATION_31' => 'YMCA',
    'CLASSFICATION_35' => '旺文社LL',
    'CLASSFICATION_36' => '登録予備校',
    'CLASSFICATION_40' => '特殊学校',
    'CLASSFICATION_41' => '朝鮮韓国学校',
    'CLASSFICATION_45' => '準会場登録塾・未登録塾',
    'CLASSFICATION_46' => '公文事務局',
    'CLASSFICATION_50' => '専修学校高等課程',
    'CLASSFICATION_51' => '盲学校',
    'CLASSFICATION_52' => '聾学校',
    'CLASSFICATION_53' => '養護学校（肢体）',
    'CLASSFICATION_54' => '養護学校',
    'CLASSFICATION_55' => '養護学校',
    // Achievement
    'MSG17' => '検索条件に一致するデータがありません。',
    //Title personal achievement
    'TitleEiken' => '%u年度第%u回実用英語技能検定',
    'TitleTableEiken' => array(
        //大問別得点・出題のねらいと学習アドバイス
        'Title8' => array(
            1 => '技能',
            2 => '大問番号・出題形式',
            3 => '正答数／<br>問題数',
            4 => '出題のねらい',
            5 => '学習アドバイス'
        )
    ),
    //UC13 - Description2 - master data
    'Description2' => array(
        //分野1
        1 => array(
            1 => '与えられたトピックの中から一つを選び、論点とその根拠をまとめ、首尾一貫したスピーチを組み立てることが求められます。',
            2 => '4コマのイラストのストーリーの流れを理解した上で、適切な表現と発音を用いて理論的にナレーションを行うことが求められます。',
            3 => '英文の内容がきちんと伝わるように、個々の単語の発音や意味の区切りなどに注意して読みことが求められます。',
            4 => '英文の内容がきちんと伝わるように、個々の単語の発音や意味の区切りなどに注意して読むことが求められます。',
            5 => '英文の内容がきちんと伝わるように、個々の単語の発音や意味の区切りなどに注意して読むことが求められます。',
            6 => '英文の内容がきちんと伝わるように、個々の単語の発音や意味の区切りなどに注意して読むことが求められます。',
            7 => '英文の内容がきちんと伝わるように、個々の単語の発音や意味の区切りなどに注意して読むことが求められます。'
        ),
        //分野2
        2 => array(
            1 => '面接委員とのやり取りの中で、それぞれの質問に対して、臨機応変に応答し、会話を継続することが求められます。',
            2 => 'イラストに関する質問では、イラストの状況に沿って、自分の意見を答えることが求められます。また、受験者自身の意見が問われる質問では、自分の考えを理論的に述べることが求められます。',
            3 => '与えられた情報（英文、イラスト）に関する質問では、情報をしっかりと理解した上で、適切な表現を使って答えることが求められます。また、受験者自身に関する質問では、質問を正確に理解した上で、それに対応した答えを述べることが求められます。',
            4 => '与えられた情報（英文、イラスト）に関する質問では、情報をしっかりと理解した上で、適切な表現を使って答えることが求められます。また、受験者自身に関する質問では、質問を正確に理解した上で、それに対応した答えを述べることが求められます。',
            5 => '与えられた情報（英文、イラスト）に関する質問では、情報をしっかりと理解した上で、適切な表現を使って答えることが求められます。また、受験者自身に関する質問では、質問を正確に理解した上で、それに対応した答えを述べることが求められます。',
            6 => '与えられた情報（英文、イラスト）に関する質問では、情報をしっかりと理解した上で、適切な表現を使って答えることが求められます。また、受験者自身に関する質問では、質問を正確に理解した上で、それに対応した答えを述べることが求められます。',
            7 => '与えられた情報（英文、イラスト）に関する質問では、情報をしっかりと理解した上で、適切な表現を使って答えることが求められます。また、受験者自身に関する質問では、質問を正確に理解した上で、それに対応した答えを述べることが求められます。'
        ),
        //分野3
        3 => array(
            1 => '面接を通じて、幅広い範囲の語い・文法を正確かつ適切に運用ủうことが求められます。',
            2 => '面接室への入室から退室までのやりとりの中で、積極的にコミュニケーションを図ろうとする態度が求められます。',
            3 => '面接室への入室から退室までのやりとりの中で、積極的にコミュニケーションの図ろうとする態度が求められます。',
            4 => '面接室への入室から退室までのやりとりの中で、積極的にコミュニケーションを図ろうとする態度が求められます。',
            5 => '面接室への入室から退室までのやりとりの中で、積極的にコミュニケーションを図ろうとする態度が求められます。'
        ),
        //分野4
        4 => array(
            1 => '面接を通じて、発音・アクセント・イントネーションを正しく運用することが求められます。',
            2 => '',
            3 => '',
            4 => '',
            5 => '',
            6 => '',
            7 => '',
        ),
        5 => array(
            1 => 'アティチュードは<br> 1：普通 2：よい 3：とてもよい を表します。'
        )
    ),
    //分野別得点とその評価のポイント - 分野 - Skill2
    'Skill2' => array(
        //EkenLevel = 1級
        1 => array(
            1 => 'SHORT SPEECH',
            2 => 'INTERACTION',
            3 => 'GRAMMAR AND VOCABULARY',
            4 => 'PRONUNCIATION'
        ),
        //EkenLevel = 準1級 
        2 => array(
            1 => 'ナレーション',
            2 => 'Ｑ＆Ａ',
            3 => 'アティチュード※'
        ),
        //EkenLevel == ,2級 , 準2級 , 3級
        3 => array(
            1 => 'リーディング',
            2 => 'Ｑ＆Ａ',
            3 => 'アティチュード※'
        ),
        //EkenLevel != 4級,5級
        4 => array(
            1 => 'リーディング',
            2 => 'Ｑ＆Ａ'
        )
    ),
    //Purpose - master data
    'Purpose' => array(
        //分野1
        1 => array(
            //大問1
            1 => array(
                1 => '単語・熟語の知識・用法を問う問題です。',
                2 => '単語・熟語の知識・用法を問う問題です。',
                3 => '単語・熟語・文法項目の知識・用法を問う問題です。',
                4 => '単語・熟語・文法項目の知識・用法を問う問題です。',
                5 => '単語・熟語・文法項目の知識・用法を問う問題です。',
                6 => '単語・熟語・文法項目の知識・用法を問う問題です。',
                7 => '単語・熟語・文法項目の知識・用法を問う問題です。'
            )
        ),
        //分野2
        2 => array(
            //大問2
            1 => array(
                1 => '長文全体の文脈や、文の関係を正しく把握する力を問う問題です。',
                2 => '長文全体の文脈や、文の関係を正しく把握する力を問う問題です。',
                3 => '長文全体の文脈や、文の関係を正しく把握する力を問う問題です。',
                4 => '会話の流れや話者の関係を把握する力を問う問題です。',
                5 => '会話の流れや話者の関係を把握する力を問う問題です。',
                6 => '会話の流れや話者の関係を把握する力を問う問題です。',
                7 => '会話の流れや話者の関係を把握する力を問う問題です。'
            ),
            //大問3
            2 => array(
                1 => '英文の細部についての正確な理解を問う問題です。',
                2 => '英文の細部についての正確な理解を問う問題です。',
                3 => '英文の細部についての正確な理解を問う問題です。',
                4 => '英作文に必要な文法力や熟語・日常的表現の知識を問う問題です。',
                5 => '英作文に必要な文法力や熟語・日常的表現の知識を問う問題です。',
                6 => '英作文に必要な文法力や熟語・日常的表現の知識を問う問題です。',
                7 => '英作文に必要な文法力や熟語・日常的表現の知識を問う問題です。'
            ),
            //大問4
            3 => array(
                1 => '英文の細部についての正確な理解を問う問題です。',
                2 => '英文の細部についての正確な理解を問う問題です。',
                3 => '英文の細部についての正確な理解を問う問題です。',
                4 => '長文全体の文脈や、文の関係を正しく把握する力を問う問題です。',
                5 => '英文の細部についての正確な理解を問う問題です。',
                6 => '英文の細部についての正確な理解を問う問題です。',
                7 => '英文の細部についての正確な理解を問う問題です。'
            ),
            //大問5
            4 => array(
                1 => '英文の細部についての正確な理解を問う問題です。',
                2 => '英文の細部についての正確な理解を問う問題です。',
                3 => '英文の細部についての正確な理解を問う問題です。',
                4 => '英文の細部についての正確な理解を問う問題です。',
                5 => '英文の細部についての正確な理解を問う問題です。',
                6 => '英文の細部についての正確な理解を問う問題です。',
                7 => '英文の細部についての正確な理解を問う問題です。'
            )
        ),
        //分野3
        3 => array(
            //Part1
            1 => array(
                1 => '会話の内容の正確な理解や、登場人物の関係などを把握する力を問う問題です。',
                2 => '会話の内容の正確な理解や、登場人物の関係などを把握する力を問う問題です。',
                3 => '会話の内容の正確な理解や、登場人物の関係などを把握する力を問う問題です。',
                4 => '会話の流れを理解し、適切な応答を選ぶことができるかを問う問題です。',
                5 => '会話の流れを理解し、適切な応答を選ぶことができるかを問う問題です。',
                6 => '会話の流れを理解し、適切な応答を選ぶことができるかを問う問題です。',
                7 => '会話の流れを理解し、適切な応答を選ぶことができるかを問う問題です。'
            ),
            //Part2
            2 => array(
                1 => '英文の内容を正確に理解しているかを問う問題です。',
                2 => '英文の内容を正確に理解しているかを問う問題です。',
                3 => '英文の内容を正確に理解しているかを問う問題です。',
                4 => '会話の内容の正確な理解や、登場人物の関係などを把握する力を問う問題です。',
                5 => '会話の内容の正確な理解や、登場人物の関係などを把握する力を問う問題です。',
                6 => '会話の内容の正確な理解や、登場人物の関係などを把握する力を問う問題です。',
                7 => '会話の内容の正確な理解や、登場人物の関係などを把握する力を問う問題です。'
            ),
            //Part3
            3 => array(
                1 => '現実の状況に即した英文の内容を正確に理解する力を問う問題です。',
                2 => '現実の状況に即した英文の内容を正確に理解する力を問う問題です。',
                3 => '英文の内容を正確に理解しているかを問う問題です。',
                4 => '英文の内容を正確に理解しているかを問う問題です。',
                5 => '英文の内容を正確に理解しているかを問う問題です。',
                6 => '英文の内容を正確に理解しているかを問う問題です。',
                7 => '英文の内容を正確に理解しているかを問う問題です。'
            ),
            //Part4
            4 => array(
                1 => '1対1のインタビュー内容を正確に理解する力を問う問題です。',
                2 => '1対1のインタビュー内容を正確に理解する力を問う問題です。',
                3 => '1対1のインタビュー内容を正確に理解する力を問う問題です。',
                4 => '1対1のインタビュー内容を正確に理解する力を問う問題です。',
                5 => '1対1のインタビュー内容を正確に理解する力を問う問題です。',
                6 => '1対1のインタビュー内容を正確に理解する力を問う問題です。',
                7 => '1対1のインタビュー内容を正確に理解する力を問う問題です。'
            )
        ),
        //分野4
        4 => array(
            //大問4
            1 => array(
                1 => array(
                    1 => '課題で求められている内容が含まれているか。',
                    2 => '英文の構成や流れが分かりやすく論理的であるか。',
                    3 => '課題に相応しい語いを正しく使えているか。',
                    4 => '文構造のバリエーションやそれらを正しく使えているか。'
                ),
                2 => array(
                    1 => '課題で求められている内容が含まれているか。',
                    2 => '英文の構成や流れが分かりやすく論理的であるか。',
                    3 => '課題に相応しい語いを正しく使えているか。',
                    4 => '文構造のバリエーションやそれらを正しく使えているか。'
                ),
                3 => array(
                    1 => '課題で求められている内容が含まれているか。',
                    2 => '英文の構成や流れが分かりやすく論理的であるか。',
                    3 => '課題に相応しい語いを正しく使えているか。',
                    4 => '文構造のバリエーションやそれらを正しく使えているか。'
                ),
                4 => '英作文に必要な文法力や熟語・日常的表現の知識を問う問題です。',
                5 => '英作文に必要な文法力や熟語・日常的表現の知識を問う問題です。',
                6 => '英作文に必要な文法力や熟語・日常的表現の知識を問う問題です。',
                7 => '英作文に必要な文法力や熟語・日常的表現の知識を問う問題です。'
            )
        ),
    ),
    'Purpose2017' => array(
        //分野1
        1 => array(
            //大問1
            1 => array(
                1 => '単語・熟語の知識・用法を問う問題です。',
                2 => '単語・熟語の知識・用法を問う問題です。',
                3 => '単語・熟語・文法項目の知識・用法を問う問題です。',
                4 => '単語・熟語・文法項目の知識・用法を問う問題です。',
                5 => '単語・熟語・文法項目の知識・用法を問う問題です。',
                6 => '単語・熟語・文法項目の知識・用法を問う問題です。',
                7 => '単語・熟語・文法項目の知識・用法を問う問題です。'
            )
        ),
        //分野2
        2 => array(
            //大問2
            1 => array(
                1 => '長文全体の文脈や、文の関係を正しく把握する力を問う問題です。',
                2 => '長文全体の文脈や、文の関係を正しく把握する力を問う問題です。',
                3 => '長文全体の文脈や、文の関係を正しく把握する力を問う問題です。',
                4 => '会話の流れや話者の関係を把握する力を問う問題です。',
                5 => '会話の流れや話者の関係を把握する力を問う問題です。',
                6 => '会話の流れや話者の関係を把握する力を問う問題です。',
                7 => '会話の流れや話者の関係を把握する力を問う問題です。'
            ),
            //大問3
            2 => array(
                1 => '英文の細部についての正確な理解を問う問題です。',
                2 => '英文の細部についての正確な理解を問う問題です。',
                3 => '英文の細部についての正確な理解を問う問題です。',
                4 => '長文全体の文脈や、文の関係を正しく把握する力を問う問題です。',
                5 => '英文の細部についての正確な理解を問う問題です。',
                6 => '英作文に必要な文法力や熟語・日常的表現の知識を問う問題です。',
                7 => '英作文に必要な文法力や熟語・日常的表現の知識を問う問題です。'
            ),
            //大問4
            3 => array(
                1 => '英文の細部についての正確な理解を問う問題です。',
                2 => '英文の細部についての正確な理解を問う問題です。',
                3 => '英文の細部についての正確な理解を問う問題です。',
                4 => '英文の細部についての正確な理解を問う問題です。',
                5 => '英文の細部についての正確な理解を問う問題です。',
                6 => '英文の細部についての正確な理解を問う問題です。',
                7 => '英文の細部についての正確な理解を問う問題です。'
            ),
            //大問5
            4 => array(
                1 => '英文の細部についての正確な理解を問う問題です。',
                2 => '英文の細部についての正確な理解を問う問題です。',
                3 => '英文の細部についての正確な理解を問う問題です。',
                4 => '英文の細部についての正確な理解を問う問題です。',
                5 => '英文の細部についての正確な理解を問う問題です。',
                6 => '英文の細部についての正確な理解を問う問題です。',
                7 => '英文の細部についての正確な理解を問う問題です。'
            )
        ),
        //分野3
        3 => array(
            //Part1
            1 => array(
                1 => '会話の内容の正確な理解や、登場人物の関係などを把握する力を問う問題です。',
                2 => '会話の内容の正確な理解や、登場人物の関係などを把握する力を問う問題です。',
                3 => '会話の内容の正確な理解や、登場人物の関係などを把握する力を問う問題です。',
                4 => '会話の流れを理解し、適切な応答を選ぶことができるかを問う問題です。',
                5 => '会話の流れを理解し、適切な応答を選ぶことができるかを問う問題です。',
                6 => '会話の流れを理解し、適切な応答を選ぶことができるかを問う問題です。',
                7 => '会話の流れを理解し、適切な応答を選ぶことができるかを問う問題です。'
            ),
            //Part2
            2 => array(
                1 => '英文の内容を正確に理解しているかを問う問題です。',
                2 => '英文の内容を正確に理解しているかを問う問題です。',
                3 => '英文の内容を正確に理解しているかを問う問題です。',
                4 => '会話の内容の正確な理解や、登場人物の関係などを把握する力を問う問題です。',
                5 => '会話の内容の正確な理解や、登場人物の関係などを把握する力を問う問題です。',
                6 => '会話の内容の正確な理解や、登場人物の関係などを把握する力を問う問題です。',
                7 => '会話の内容の正確な理解や、登場人物の関係などを把握する力を問う問題です。'
            ),
            //Part3
            3 => array(
                1 => '現実の状況に即した英文の内容を正確に理解する力を問う問題です。',
                2 => '現実の状況に即した英文の内容を正確に理解する力を問う問題です。',
                3 => '英文の内容を正確に理解しているかを問う問題です。',
                4 => '英文の内容を正確に理解しているかを問う問題です。',
                5 => '英文の内容を正確に理解しているかを問う問題です。',
                6 => '英文の内容を正確に理解しているかを問う問題です。',
                7 => '英文の内容を正確に理解しているかを問う問題です。'
            ),
            //Part4
            4 => array(
                1 => '1対1のインタビュー内容を正確に理解する力を問う問題です。',
                2 => '1対1のインタビュー内容を正確に理解する力を問う問題です。',
                3 => '1対1のインタビュー内容を正確に理解する力を問う問題です。',
                4 => '1対1のインタビュー内容を正確に理解する力を問う問題です。',
                5 => '1対1のインタビュー内容を正確に理解する力を問う問題です。',
                6 => '1対1のインタビュー内容を正確に理解する力を問う問題です。',
                7 => '1対1のインタビュー内容を正確に理解する力を問う問題です。'
            )
        ),
        //分野4
        4 => array(
            //大問4
            1 => array(
                1 => array(
                    1 => '課題で求められている内容が含まれているか。',
                    2 => '英文の構成や流れが分かりやすく論理的であるか。',
                    3 => '課題に相応しい語いを正しく使えているか。',
                    4 => '文構造のバリエーションやそれらを正しく使えているか。'
                ),
                2 => array(
                    1 => '課題で求められている内容が含まれているか。',
                    2 => '英文の構成や流れが分かりやすく論理的であるか。',
                    3 => '課題に相応しい語いを正しく使えているか。',
                    4 => '文構造のバリエーションやそれらを正しく使えているか。'
                ),
                3 => array(
                    1 => '課題で求められている内容が含まれているか。',
                    2 => '英文の構成や流れが分かりやすく論理的であるか。',
                    3 => '課題に相応しい語いを正しく使えているか。',
                    4 => '文構造のバリエーションやそれらを正しく使えているか。'
                ),
                4 => array(
                    1 => '課題で求められている内容が含まれているか。',
                    2 => '英文の構成や流れが分かりやすく論理的であるか。',
                    3 => '課題に相応しい語いを正しく使えているか。',
                    4 => '文構造のバリエーションやそれらを正しく使えているか。'
                ),
                5 => array(
                    1 => '課題で求められている内容が含まれているか。',
                    2 => '英文の構成や流れが分かりやすく論理的であるか。',
                    3 => '課題に相応しい語いを正しく使えているか。',
                    4 => '文法的に正しい英文が書けているか。'
                ),
                6 => '英作文に必要な文法力や熟語・日常的表現の知識を問う問題です。',
                7 => '英作文に必要な文法力や熟語・日常的表現の知識を問う問題です。'
            )
        ),
    ),
    'Purpose2015' => array(
        //分野1
        1 => array(
            //大問1
            1 => array(
                1 => '単語・熟語の知識・用法を問う問題です。',
                2 => '単語・熟語の知識・用法を問う問題です。',
                3 => '単語・熟語・文法項目の知識・用法を問う問題です。',
                4 => '単語・熟語・文法項目の知識・用法を問う問題です。',
                5 => '単語・熟語・文法項目の知識・用法を問う問題です。',
                6 => '単語・熟語・文法項目の知識・用法を問う問題です。',
                7 => '単語・熟語・文法項目の知識・用法を問う問題です。'
            )
        ),
        //分野2
        2 => array(
            //大問2
            1 => array(
                1 => '長文全体の文脈や、文の関係を正しく把握する力を問う問題です。',
                2 => '長文全体の文脈や、文の関係を正しく把握する力を問う問題です。',
                3 => '長文全体の文脈や、文の関係を正しく把握する力を問う問題です。',
                4 => '会話の流れや話者の関係を把握する力を問う問題です。',
                5 => '会話の流れや話者の関係を把握する力を問う問題です。',
                6 => '会話の流れや話者の関係を把握する力を問う問題です。',
                7 => '会話の流れや話者の関係を把握する力を問う問題です。'
            ),
            //大問3
            2 => array(
                1 => '英文の細部についての正確な理解を問う問題です。',
                2 => '英文の細部についての正確な理解を問う問題です。',
                3 => '英文の細部についての正確な理解を問う問題です。',
                4 => '長文全体の文脈や、文の関係を正しく把握する力を問う問題です。',
                5 => '英文の細部についての正確な理解を問う問題です。',
                6 => '英文の細部についての正確な理解を問う問題です。',
                7 => '英文の細部についての正確な理解を問う問題です。'
            ),
            //大問4
            3 => array(
                1 => '英文の細部についての正確な理解を問う問題です。',
                2 => '英文の細部についての正確な理解を問う問題です。',
                3 => '英文の細部についての正確な理解を問う問題です。',
                4 => '英文の細部についての正確な理解を問う問題です。',
                5 => '英文の細部についての正確な理解を問う問題です。',
                6 => '英文の細部についての正確な理解を問う問題です。',
                7 => '英文の細部についての正確な理解を問う問題です。'
            ),
            //大問5
            4 => array(
                1 => '英文の細部についての正確な理解を問う問題です。',
                2 => '英文の細部についての正確な理解を問う問題です。',
                3 => '英文の細部についての正確な理解を問う問題です。',
                4 => '英文の細部についての正確な理解を問う問題です。',
                5 => '英文の細部についての正確な理解を問う問題です。',
                6 => '英文の細部についての正確な理解を問う問題です。',
                7 => '英文の細部についての正確な理解を問う問題です。'
            )
        ),
        //分野3
        3 => array(
            //Part1
            1 => array(
                1 => '会話の内容の正確な理解や、登場人物の関係などを把握する力を問う問題です。',
                2 => '会話の内容の正確な理解や、登場人物の関係などを把握する力を問う問題です。',
                3 => '会話の内容の正確な理解や、登場人物の関係などを把握する力を問う問題です。',
                4 => '会話の流れを理解し、適切な応答を選ぶことができるかを問う問題です。',
                5 => '会話の流れを理解し、適切な応答を選ぶことができるかを問う問題です。',
                6 => '会話の流れを理解し、適切な応答を選ぶことができるかを問う問題です。',
                7 => '会話の流れを理解し、適切な応答を選ぶことができるかを問う問題です。'
            ),
            //Part2
            2 => array(
                1 => '英文の内容を正確に理解しているかを問う問題です。',
                2 => '英文の内容を正確に理解しているかを問う問題です。',
                3 => '英文の内容を正確に理解しているかを問う問題です。',
                4 => '会話の内容の正確な理解や、登場人物の関係などを把握する力を問う問題です。',
                5 => '会話の内容の正確な理解や、登場人物の関係などを把握する力を問う問題です。',
                6 => '会話の内容の正確な理解や、登場人物の関係などを把握する力を問う問題です。',
                7 => '会話の内容の正確な理解や、登場人物の関係などを把握する力を問う問題です。'
            ),
            //Part3
            3 => array(
                1 => '現実の状況に即した英文の内容を正確に理解する力を問う問題です。',
                2 => '現実の状況に即した英文の内容を正確に理解する力を問う問題です。',
                3 => '英文の内容を正確に理解しているかを問う問題です。',
                4 => '英文の内容を正確に理解しているかを問う問題です。',
                5 => '英文の内容を正確に理解しているかを問う問題です。',
                6 => '英文の内容を正確に理解しているかを問う問題です。',
                7 => '英文の内容を正確に理解しているかを問う問題です。'
            ),
            //Part4
            4 => array(
                1 => '1対1のインタビュー内容を正確に理解する力を問う問題です。',
                2 => '1対1のインタビュー内容を正確に理解する力を問う問題です。',
                3 => '1対1のインタビュー内容を正確に理解する力を問う問題です。',
                4 => '1対1のインタビュー内容を正確に理解する力を問う問題です。',
                5 => '1対1のインタビュー内容を正確に理解する力を問う問題です。',
                6 => '1対1のインタビュー内容を正確に理解する力を問う問題です。',
                7 => '1対1のインタビュー内容を正確に理解する力を問う問題です。'
            )
        ),
        //分野4
        4 => array(
            //大問4
            1 => array(
                1 => '与えられたトピックに関して、論理的な文章を書く力を問う問題です。',
                2 => 'Eメールや手紙の内容を正確に理解し、それに対して適切な返信を100語程度で書く力を問う問題です。',
                3 => '英作文に必要な文法力や熟語・日常的表現の知識を問う問題です。',
                4 => '英作文に必要な文法力や熟語・日常的表現の知識を問う問題です。',
                5 => '英作文に必要な文法力や熟語・日常的表現の知識を問う問題です。',
                6 => '英作文に必要な文法力や熟語・日常的表現の知識を問う問題です。',
                7 => '英作文に必要な文法力や熟語・日常的表現の知識を問う問題です。'
            )
        ),
    ),
    'Skill' => array(
        1 => array(
            1 => '語い・熟語・文法',
            2 => '読解',
            3 => 'リスニング',
            4 => '作文'
        ),
        2 => array(
            1 => '',
            2 => '',
            3 => '',
            4 => ''
        )
    ),
    'SkillMondai4' => array(
        1 => '内容',
        2 => '構成',
        3 => '語い',
        4 => '文法'
    ),
    'SkillEng' => array(
        1 => array(
            1 => 'Reading',
            2 => 'Listening',
            3 => 'Writing',
        ),
    ),
    'ScoreTotal' => array(
        1 => array(
            'A' => 1500,
            'B' => 1400,
            'C' => 1300,
            'D' => 1200,
            'E' => 1100,
            'F' => 1020
        ),
        2 => array()
    ),
    'mappingStatus' => array(\History\HistoryConst::UNCONFIRM_STATUS => '未確定', \History\HistoryConst::CONFIRMED_STATUS => '確定済'),
    'logicPassFail' => array(0 => '不合格', 1 => '合格'),
    'noResultIsFoundMSG12' => '検索条件に一致するデータがありません。',
    'registerStudentlistFirstMSG57'  => '生徒名簿が登録されていません。試験情報と生徒名簿を対応付けする場合は、まず生徒名簿を登録してください。',
    'eikenResultConfirmSuccessMEG58' => '確定した情報を保存しました。',
    'errorsHappenWhenRetrievingResultsContactAdminMEG59' => 'サーバからの試験結果情報取得に失敗しました。システム管理者にご連絡ください。',
    'errorsHappenContactAdminMEG60' => '処理中にエラーが発生しました。システム管理者にご連絡ください。',
    'btnStudentList'=> '生徒名簿を登録する',
  
    'MsgNoRecordExcel' => 'エクスポート対象がありません。',
    'Tl1' => '団体試験結果_英検_%d年度%d回.xlsx',
    'Tl5' => '英検履歴_%s_%s_%s_%s.xlsx',
    'Tl7' => '英検IBA履歴_%s_%s_%s_%s.xlsx',
    'exportExcel' => 'Excel出力',
    'fileNameExcelPupilAchievement' => '英検試験結果一覧_%s年度%s回%s',
    'fileNameExcelExamHistoryList' => '個人試験結果_%s年度%s',
    'fileNameExcelIbaPupilAchievement' => '英検IBA試験結果一覧_%s%s',
    'title-1' => '表示なし、',
    'title-2' => '表示あり',
    'junihyojiseigen-1' => '表示なし、',
    'junihyojiseigen-2' => '変更あり',
    'seisekijun-1' => '順位・平均あり、',
    'seisekijun-2' => '順位なし、平均あり、',
    'seisekijun-3' => '順位・平均なし',
    'eikenLevel-1' => '付与する',
    'eikenLevel-2' => '付与しない',
    'eikenkyulvlisten-1' => 'ID順、',
    'eikenkyulvlisten-2' => '学年・組・番号順、',
    'eikenkyulvlisten-3' => '指定なし',
    'resultDocOutput-1' => 'ID順、',
    'resultDocOutput-2' => '学年・組・番号順',
    'resultDocOutput-3' => '指定なし',
    'rankDisplay-1' => '順位・平均あり',
    'rankDisplay-2' => '順位なし、平均あり',
    'rankDisplay-3' => '順位・平均なし',
    'eikenIdDisplay-1' => '表示なし',
    'eikenIdDisplay-2' => '表示あり',
    'titleUpdate-1' => '変更なし',
    'titleUpdate-2' => '変更あり',
    'export-IBA-filename' => '団体試験結果_英検IBA_',
    'SHOW_POPUP_MSG14'=>'%s年度第%s回英検の一次試験結果データがあります。<br>「次へ」を押して内容を確認してください。',
    'SHOW_POPUP_MSG15'=>'以下のテスト結果が新たに更新されました。',
    'SHOW_POPUP_MSG59'=>'サーバからの試験結果情報取得に失敗しました。システム管理者にご連絡ください。',
    'SHOW_POPUP_MSG_CONFIRM_EXAM_RESULT'=>'「OK」を押すと、取り込んだ過去試験データは保存されずに終了します。保存する場合は「戻る」を押してください。',
    'SHOW_POPUP_MSG_PUPIL_NO_NAME_KANNA'=>'姓名のカナ情報が登録されていない生徒情報があります。カナ情報がない場合、IBA試験結果情報と生徒名簿の突合が出来ません。%sをクリックして、カナ情報の登録がない生徒の一覧を見ることができます。',
    'lbHasNewData' => 'あり',
    'lbFullData' => 'なし',
    'examType_other' => '能力向上事業',
    'examType_IBA' => '英検IBA',
    'msgReImport' => 'この試験結果は、すでに一度団体サポートシステムに取り込まれています。改めて取り込む際には、前回取り込み時との差分に対してのみ、システムによる突合を実行します。取り込み後に、突合結果を確認してください。'

);
